lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/app_ble.c
  //reset list of scanned devices
  memset(&scannedDevicesPackage, 0 , sizeof(scannedDevicesPackage));

  //reset used device informations
  memset(usedDeviceInformations, 0 , sizeof(usedDeviceInformations));
  defineMethodes(sizeof(usedDeviceInformations)/sizeof(UsedDeviceInformations_t), usedDeviceInformations);

  //reset calibration parameters
  memset(&bikeDataInformation, 0 , sizeof(bikeDataInformation));


  //reset flash
  settings_t settingsToWrite;
  memset(&settingsToWrite, 0 , sizeof(settingsToWrite));

  //initilase sensor hardcode
 //strcpy(settingsToWrite.sensors[0].name,"	Tacx Vortex 18043");
 //memcpy(settingsToWrite.sensors[0].macAddress, macTackxVortex, sizeof(settingsToWrite.sensors[0].macAddress));
//
 //strcpy(settingsToWrite.sensors[2].name,"	Ridesense");
// memcpy(settingsToWrite.sensors[2].macAddress, macRidesense, sizeof(settingsToWrite.sensors[2].macAddress));
//
 //strcpy(settingsToWrite.sensors[0].name,"	EWWU111");
// memcpy(settingsToWrite.sensors[0].macAddress, macShimano, sizeof(settingsToWrite.sensors[1].macAddress)); //****IMPORTANT** shimano doit être en premier [0] dans le tableau

 //strcpy(settingsToWrite.sensors[1].name,"	Tacx Flux");
// memcpy(settingsToWrite.sensors[1].macAddress, macTackxFlux, sizeof(settingsToWrite.sensors[0].macAddress));


  saveToFlash((uint8_t*) &settingsToWrite, sizeof(settingsToWrite));


/* USER CODE END APP_BLE_Init_2 */
  return;
}

void Trigger_Scan_Request( void ){
	UTIL_SEQ_SetTask(1 << CFG_TASK_START_SCAN_ID, CFG_SCH_PRIO_1);
}

void Trigger_Connection_Request( int indexInFlash,int indexInScannedDevices,Pairing_request_status status, uint16_t connhandle){
	switch(indexInFlash){
		case 0:
			if(status == CONNECTING){
				UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_1_ID, CFG_SCH_PRIO_0);
			}
			else{
				aci_gap_terminate(connhandle, 0x16);
				usedDeviceInformations[0].state = APP_BLE_IDLE;
				scannedDevicesPackage.scannedDevicesList[indexInScannedDevices].pairingStatus = usedDeviceInformations[0].state;
			}

			break;
		case 1:
			if(status == CONNECTING){
				UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_2_ID, CFG_SCH_PRIO_0);
			}
			else{
				aci_gap_terminate(connhandle, 0x05);
				usedDeviceInformations[1].state = APP_BLE_IDLE;
				scannedDevicesPackage.scannedDevicesList[indexInScannedDevices].pairingStatus = usedDeviceInformations[1].state;
			}

			break;
		case 2:
			if(status == CONNECTING){
				UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_3_ID, CFG_SCH_PRIO_0);
			}
			else{
				aci_gap_terminate(connhandle, 0x05);
				usedDeviceInformations[2].state = APP_BLE_IDLE;
				scannedDevicesPackage.scannedDevicesList[indexInScannedDevices].pairingStatus = usedDeviceInformations[2].state;
			}

			break;
		case 3:
			if(status == CONNECTING){
				UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_4_ID, CFG_SCH_PRIO_0);
			}
			else{
				aci_gap_terminate(connhandle, 0x05);
				usedDeviceInformations[3].state = APP_BLE_IDLE;
				scannedDevicesPackage.scannedDevicesList[indexInScannedDevices].pairingStatus = usedDeviceInformations[3].state;
			}

			break;
		default:
			break;
	}
}

uint16_t Update_UsedDeviceInformations_structure( void )
{
    settings_t readSettings;
    readFlash((uint8_t*)&readSettings);

    int isFlashEmpty = 0;
    int isUsedDeviceEmpty = 0;
    uint16_t connhandle = 0;

    //used to add devices in usedDeviceStructure

    for(int i = 0; i < sizeof(readSettings.sensors) / sizeof(readSettings.sensors[0]); i++){
    	for(int k = 0; k < scannedDevicesPackage.numberOfScannedDevices; k++){
    		if(strcmp(scannedDevicesPackage.scannedDevicesList[k].deviceName, readSettings.sensors[i].name) == 0 ||
    				memcmp(scannedDevicesPackage.scannedDevicesList[k].macAddress, readSettings.sensors[i].macAddress, sizeof(readSettings.sensors[i].macAddress)) == 0){

    			isFlashEmpty = 0; //reset between iterations

        		for(int idx = 0; idx < sizeof(readSettings.sensors[i].name);idx++){
        			isFlashEmpty |= readSettings.sensors[i].name[idx];
        		}
        		if(isFlashEmpty != 0){ //flash is not empty

        			isUsedDeviceEmpty = 0; //reset between iterations

            		for(int idx = 0; idx < sizeof(usedDeviceInformations[i].name);idx++){
            			isUsedDeviceEmpty |= usedDeviceInformations[i].name[idx];
            		}
            		if(isUsedDeviceEmpty == 0){ //used device is empty - newly added
            			strcpy(usedDeviceInformations[i].name, readSettings.sensors[i].name);
            			memcpy(usedDeviceInformations[i].macAddress, readSettings.sensors[i].macAddress, sizeof(usedDeviceInformations[i].macAddress));
            			usedDeviceInformations[i].isNotEmpty = true;
            			usedDeviceInformations[i].connHandle = 0xFFFF;  // a changer
            		}
        		}
    		}
    	}
    }
    //used to remove devices in usedDeviceStructure

    for(int i = 0; i < sizeof(readSettings.sensors) / sizeof(readSettings.sensors[0]); i++){
    	for(int k = 0; k < sizeof(usedDeviceInformations)/ sizeof(usedDeviceInformations[0]); k++){
    		if(memcmp(readSettings.sensors[i].macAddress, usedDeviceInformations[k].macAddress, sizeof(usedDeviceInformations[k].macAddress)) != 0 && i == k){
    			connhandle = usedDeviceInformations[k].connHandle;
    			clearList(&usedDeviceInformations[k]);
    			memset(&usedDeviceInformations[k].name,0,sizeof(usedDeviceInformations[k].name));
    			memset(&usedDeviceInformations[k].macAddress,0,sizeof(usedDeviceInformations[k].macAddress));
    			usedDeviceInformations[k].state = APP_BLE_IDLE;
    			usedDeviceInformations[k].isNotEmpty = false;
    			memset(&usedDeviceInformations[k].supportedDataType,0,sizeof(usedDeviceInformations[k].supportedDataType));
    			usedDeviceInformations[k].sensorType = OTHER;

    			//memset(&usedDeviceInformations[k],0,sizeof(usedDeviceInformations[k]));
    			break;
    		}
    	}
    }

    return connhandle;

}

SVCCTL_UserEvtFlowStatus_t SVCCTL_App_Notification(void *pckt)
{
  hci_event_pckt *event_pckt;
  evt_le_meta_event *meta_evt;
  hci_le_connection_complete_event_rp0 * connection_complete_event;
  evt_blue_aci *blue_evt;
  hci_le_advertising_report_event_rp0 * le_advertising_event;
  event_pckt = (hci_event_pckt*) ((hci_uart_pckt *) pckt)->data;
  uint8_t result;
  uint8_t role, event_type, event_data_size;
  int k = 0;
  uint8_t *adv_report_data;
  uint8_t adtype, adlength;
  hci_disconnection_complete_event_rp0 *cc = (void *) event_pckt->data;

	//printf("event_pckt: %x\n\r",event_pckt->evt);
  switch (event_pckt->evt)
  {
    /* USER CODE BEGIN evt */

    /* USER CODE END evt */
    case EVT_VENDOR:
    {
      handleNotification.P2P_Evt_Opcode = P2P_SERVER1_DISCON_HANDLE_EVT;
      blue_evt = (evt_blue_aci*) event_pckt->data;
      /* USER CODE BEGIN EVT_VENDOR */
      //printf("ecode: %x\n\r",blue_evt->ecode);
      /* USER CODE END EVT_VENDOR */

