lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/app_ble.c
      switch (blue_evt->ecode)
      {
      /* USER CODE BEGIN ecode */

      /* USER CODE END ecode */
        case EVT_BLUE_GAP_PROCEDURE_COMPLETE:
        {
          /* USER CODE BEGIN EVT_BLUE_GAP_PROCEDURE_COMPLETE */

          /* USER CODE END EVT_BLUE_GAP_PROCEDURE_COMPLETE */
          aci_gap_proc_complete_event_rp0 *gap_evt_proc_complete = (void*) blue_evt->data;
          /* CHECK GAP GENERAL DISCOVERY PROCEDURE COMPLETED & SUCCEED */
          if (gap_evt_proc_complete->Procedure_Code == GAP_GENERAL_DISCOVERY_PROC
              && gap_evt_proc_complete->Status == 0x00)
          {
            /* USER CODE BEGIN GAP_GENERAL_DISCOVERY_PROC */
            //BSP_LED_Off(LED_BLUE);

            /* USER CODE END GAP_GENERAL_DISCOVERY_PROC */

            Update_UsedDeviceInformations_structure();

            APP_DBG_MSG("-- GAP GENERAL DISCOVERY PROCEDURE_COMPLETED\n");
            /*if a device found, connect to it, device 1 being chosen first if both found*/
            if (usedDeviceInformations[0].isNotEmpty
                && usedDeviceInformations[0].state != APP_BLE_CONNECTED_CLIENT)
            {
              UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_1_ID, CFG_SCH_PRIO_0);
            }
#if (CFG_P2P_DEMO_MULTI != 0)
          /* USER CODE BEGIN EVT_BLUE_GAP_PROCEDURE_COMPLETE_Multi */
            else if (usedDeviceInformations[1].isNotEmpty
            		&& usedDeviceInformations[1].state != APP_BLE_CONNECTED_CLIENT)
            {
              UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_2_ID, CFG_SCH_PRIO_0);
            }
            else if (usedDeviceInformations[2].isNotEmpty
                && usedDeviceInformations[2].state != APP_BLE_CONNECTED_CLIENT)
            {
              UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_3_ID, CFG_SCH_PRIO_0);
            }
            else if (usedDeviceInformations[3].isNotEmpty
                && usedDeviceInformations[3].state != APP_BLE_CONNECTED_CLIENT)
            {
              UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_4_ID, CFG_SCH_PRIO_0);
            }
          /* USER CODE END EVT_BLUE_GAP_PROCEDURE_COMPLETE_Multi */
#endif

          }

        }
        break; /* EVT_BLUE_GAP_PAIRING_CMPLT */

        case EVT_BLUE_L2CAP_CONNECTION_UPDATE_REQ:
        {
         /* USER CODE BEGIN EVT_BLUE_L2CAP_CONNECTION_UPDATE_REQ */

          /* USER CODE END EVT_BLUE_L2CAP_CONNECTION_UPDATE_REQ */
          aci_l2cap_connection_update_req_event_rp0 *pr = (aci_l2cap_connection_update_req_event_rp0 *) blue_evt->data;
          APP_BLE_p2p_Conn_Update_req.Connection_Handle = pr->Connection_Handle;
          APP_BLE_p2p_Conn_Update_req.Identifier = pr->Identifier;
          APP_BLE_p2p_Conn_Update_req.L2CAP_Length = pr->L2CAP_Length;
          APP_BLE_p2p_Conn_Update_req.Interval_Min = pr->Interval_Min;
          APP_BLE_p2p_Conn_Update_req.Interval_Max = pr->Interval_Max;
          APP_BLE_p2p_Conn_Update_req.Slave_Latency = pr->Slave_Latency;
          APP_BLE_p2p_Conn_Update_req.Timeout_Multiplier = pr->Timeout_Multiplier;

          /*printf("\n interval min :%d",pr->Interval_Min);
          printf("\n interval max :%d",pr->Interval_Max);
          printf("\n slave latency :%d",pr->Slave_Latency);
          printf("\n timeout_multi :%d",pr->Timeout_Multiplier);*/

          result = aci_l2cap_connection_parameter_update_resp(APP_BLE_p2p_Conn_Update_req.Connection_Handle,
                                                              APP_BLE_p2p_Conn_Update_req.Interval_Min,
                                                              APP_BLE_p2p_Conn_Update_req.Interval_Max,
                                                              APP_BLE_p2p_Conn_Update_req.Slave_Latency,
                                                              APP_BLE_p2p_Conn_Update_req.Timeout_Multiplier,
                                                              CONN_L(10),
                                                              CONN_L(10),
                                                              APP_BLE_p2p_Conn_Update_req.Identifier,
                                                              0x01);
          APP_DBG_MSG("\r\n\r** NO UPDATE \n");
          if(result != BLE_STATUS_SUCCESS) {
              /* USER CODE BEGIN BLE_STATUS_SUCCESS */
              BSP_LED_On(LED_RED);
              /* USER CODE END BLE_STATUS_SUCCESS */
          }

        }

        break;

        default:
          /* USER CODE BEGIN ecode_default */

          /* USER CODE END ecode_default */
          break;
      }
    }
    break; /* EVT_VENDOR */

    case EVT_DISCONN_COMPLETE:

      /* USER CODE BEGIN EVT_DISCONN_COMPLETE */


      /* USER CODE END EVT_DISCONN_COMPLETE */

    	if(cc->Reason != 0x16){ //user terminated connection
    	      if (cc->Connection_Handle == BleApplicationContext.connectionHandleEndDevice1)
    	      {

    	        APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT OF END DEVICE 1 \n");
    	        usedDeviceInformations[0].state = APP_BLE_IDLE;
    	        usedDeviceInformations[0].connHandle = 0xFFFF;
    	        clearList(&usedDeviceInformations[0]);

    	        handleNotification.P2P_Evt_Opcode = P2P_SERVER1_DISCON_HANDLE_EVT;
    	        handleNotification.ConnectionHandle = connection_handle;
    	        Evt_Notification(&handleNotification);
    	      }

    	      if (cc->Connection_Handle == BleApplicationContext.connectionHandleCentral)
    	      {
    	        APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT OF SMART PHONE \n");
    	        BleApplicationContext.connectionHandleCentral = APP_BLE_IDLE;
    	        handleNotification.P2P_Evt_Opcode = SMART_PHONE1_DISCON_HANDLE_EVT;
    	        handleNotification.ConnectionHandle = 0xFFFF;
    	        Evt_Notification(&handleNotification);
    	      }

    	#if (CFG_P2P_DEMO_MULTI != 0)
    	      /* USER CODE BEGIN EVT_DISCONN_COMPLETE_Multi */
    	      if (cc->Connection_Handle == BleApplicationContext.connectionHandleEndDevice2)
    	      {

    	        APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT OF END DEVICE 2 \n");
    	        usedDeviceInformations[1].state = APP_BLE_IDLE;
    	        usedDeviceInformations[1].connHandle = 0xFFFF;
    	        clearList(&usedDeviceInformations[1]);
    	        handleNotification.P2P_Evt_Opcode = P2P_SERVER2_DISCON_HANDLE_EVT;
    	        handleNotification.ConnectionHandle = connection_handle;
    	        Evt_Notification(&handleNotification);
    	      }
    	      if (cc->Connection_Handle == BleApplicationContext.connectionHandleEndDevice3)
    	      {

    	        APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT OF END DEVICE 3 \n");
    	        usedDeviceInformations[2].state = APP_BLE_IDLE;
    	        usedDeviceInformations[2].connHandle = 0xFFFF;
    	        clearList(&usedDeviceInformations[2]);
    	        handleNotification.P2P_Evt_Opcode = P2P_SERVER3_DISCON_HANDLE_EVT;
    	        handleNotification.ConnectionHandle = connection_handle;
    	        Evt_Notification(&handleNotification);
    	      }
    	      if (cc->Connection_Handle == BleApplicationContext.connectionHandleEndDevice4)
    	      {

    	        APP_DBG_MSG("\r\n\r** DISCONNECTION EVENT OF END DEVICE 4 \n");
    	        usedDeviceInformations[3].state = APP_BLE_IDLE;
    	        usedDeviceInformations[3].connHandle = 0xFFFF;
    	        clearList(&usedDeviceInformations[3]);
    	        handleNotification.P2P_Evt_Opcode = P2P_SERVER4_DISCON_HANDLE_EVT;
    	        handleNotification.ConnectionHandle = connection_handle;
    	        Evt_Notification(&handleNotification);
    	      }


    	      /* USER CODE END EVT_DISCONN_COMPLETE_Multi */
    	#endif
    	}


      break; /* EVT_DISCONN_COMPLETE */

    case EVT_LE_META_EVENT:

      /* USER CODE BEGIN EVT_LE_META_EVENT */

      /* USER CODE END EVT_LE_META_EVENT */
      meta_evt = (evt_le_meta_event*) event_pckt->data;

