lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/app_ble.c
      switch (meta_evt->subevent)
      {
      /* USER CODE BEGIN subevent */

      /* USER CODE END subevent */
        case EVT_LE_CONN_COMPLETE:
          /* USER CODE BEGIN EVT_LE_CONN_COMPLETE */



          /* USER CODE END EVT_LE_CONN_COMPLETE */
          /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */
          connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;

          connection_handle = connection_complete_event->Connection_Handle;
          role = connection_complete_event->Role;
          if (role == 0x00)
          { /* ROLE MASTER */

            uint8_t dev1 = 1
#if (CFG_P2P_DEMO_MULTI != 0)
          /* USER CODE BEGIN EVT_LE_CONN_COMPLETE_Multi */
           , dev2 = 1,dev3 = 1,dev4 = 1
          /* USER CODE END EVT_LE_CONN_COMPLETE_Multi */
#endif
                ;


            for (int i = 0; i < 6; i++)
            {
              dev1 &= (usedDeviceInformations[0].macAddress[i] == connection_complete_event->Peer_Address[i]);
#if (CFG_P2P_DEMO_MULTI != 0)
          /* USER CODE BEGIN EVT_LE_CONN_COMPLETE_Multi_2 */
              dev2 &= (usedDeviceInformations[1].macAddress[i] == connection_complete_event->Peer_Address[i]);
              dev3 &= (usedDeviceInformations[2].macAddress[i] == connection_complete_event->Peer_Address[i]);
              dev4 &= (usedDeviceInformations[3].macAddress[i] == connection_complete_event->Peer_Address[i]);
          /* USER CODE END EVT_LE_CONN_COMPLETE_Multi_2 */
#endif
            }

            if (dev1 == 1)
            {
              /* Inform Application it is End Device 1 */
              int index0 = getCorrespondingIndex(usedDeviceInformations[0].macAddress);

              APP_DBG_MSG("-- CONNECTION SUCCESS WITH END DEVICE 1\n");
              usedDeviceInformations[0].state = APP_BLE_CONNECTED_CLIENT;
              usedDeviceInformations[0].connHandle = connection_handle;
              scannedDevicesPackage.scannedDevicesList[index0].pairingStatus =  usedDeviceInformations[0].state;
              BleApplicationContext.connectionHandleEndDevice1 = connection_handle;
              BleApplicationContext.BleApplicationContext_legacy.connectionHandle[0] = connection_handle;
              handleNotification.P2P_Evt_Opcode = P2P_SERVER1_CONN_HANDLE_EVT;
              handleNotification.ConnectionHandle = connection_handle;
              Evt_Notification(&handleNotification);
              result = aci_gatt_disc_all_primary_services(BleApplicationContext.connectionHandleEndDevice1);
              if (result == BLE_STATUS_SUCCESS)
              {
                APP_DBG_MSG("\r\n\r** GATT SERVICES & CHARACTERISTICS DISCOVERY  \n");
                APP_DBG_MSG("* GATT :  Start Searching Primary Services \r\n\r");
              }
              else
              {
                APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
              }
#if (CFG_P2P_DEMO_MULTI != 0)
          /* USER CODE BEGIN EVT_LE_CONN_COMPLETE_Multi_3 */
          /* Now try to connect to device 2 */
              if ((usedDeviceInformations[1].state != APP_BLE_CONNECTED_CLIENT)
                  && (usedDeviceInformations[1].isNotEmpty))
              {
                UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_2_ID, CFG_SCH_PRIO_0);
              }
          /* USER CODE END EVT_LE_CONN_COMPLETE_Multi_3 */
#endif

            }
#if (CFG_P2P_DEMO_MULTI != 0)
          /* USER CODE BEGIN EVT_LE_CONN_COMPLETE_Multi_4 */
          if (dev2 == 1)
            {
              /* Inform Application it is End Device 2 */
        	  int index1 = getCorrespondingIndex(usedDeviceInformations[1].macAddress);

              APP_DBG_MSG("-- CONNECTION SUCCESS WITH END DEVICE 2\n");
              usedDeviceInformations[1].state = APP_BLE_CONNECTED_CLIENT;
              usedDeviceInformations[1].connHandle = connection_handle;
              scannedDevicesPackage.scannedDevicesList[index1].pairingStatus =  usedDeviceInformations[1].state;
              BleApplicationContext.connectionHandleEndDevice2 = connection_handle;
              BleApplicationContext.BleApplicationContext_legacy.connectionHandle[1] = connection_handle;
              handleNotification.P2P_Evt_Opcode = P2P_SERVER2_CONN_HANDLE_EVT;
              handleNotification.ConnectionHandle = connection_handle;
              Evt_Notification(&handleNotification);
              result = aci_gatt_disc_all_primary_services(BleApplicationContext.connectionHandleEndDevice2);
              if (result == BLE_STATUS_SUCCESS)
              {
                APP_DBG_MSG("* GATT : Start Searching Primary Services \r\n\r");
              }
              else
              {
                APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
              }
              /* Now try to connect to device 1 */
              if ((usedDeviceInformations[2].state != APP_BLE_CONNECTED_CLIENT)
                  && (usedDeviceInformations[2].isNotEmpty))
              {

                UTIL_SEQ_SetTask(1 << CFG_TASK_CONN_DEV_3_ID, CFG_SCH_PRIO_0);
              }
            }
            if (dev3 == 1)
            {
              /* Inform Application it is End Device 3 */

              int index2 = getCorrespondingIndex(usedDeviceInformations[2].macAddress);

              APP_DBG_MSG("-- CONNECTION SUCCESS WITH END DEVICE 3\n");

              usedDeviceInformations[2].state = APP_BLE_CONNECTED_CLIENT;
              usedDeviceInformations[2].connHandle = connection_handle;
              scannedDevicesPackage.scannedDevicesList[index2].pairingStatus =  usedDeviceInformations[2].state;
              BleApplicationContext.connectionHandleEndDevice3 = connection_handle;
              BleApplicationContext.BleApplicationContext_legacy.connectionHandle[2] = connection_handle;
              handleNotification.P2P_Evt_Opcode = P2P_SERVER3_CONN_HANDLE_EVT;
              handleNotification.ConnectionHandle = connection_handle;
              Evt_Notification(&handleNotification);
              result = aci_gatt_disc_all_primary_services(BleApplicationContext.connectionHandleEndDevice3);
              if (result == BLE_STATUS_SUCCESS)
              {
                APP_DBG_MSG("* GATT : Start Searching Primary Services \r\n\r");
              }
              else
              {
                APP_DBG_MSG("BLE_CTRL_App_Notification(), All services discovery Failed \r\n\r");
              }
              /* Now try to connect to device 4 */
              if ((usedDeviceInformations[3].state != APP_BLE_CONNECTED_CLIENT)
                  && (usedDeviceInformations[3].isNotEmpty))
              {

