lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/app_ble.c
}

/**
 * @brief  Scan Request
 * @param  None
 * @retval None
 */
static void Scan_Request( void )
{
  /* USER CODE BEGIN Scan_Request_1 */

  /* USER CODE END Scan_Request_1 */
  tBleStatus result;

  if (BleApplicationContext.EndDevice_Connection_Status[0] != APP_BLE_CONNECTED_CLIENT

#if (CFG_P2P_DEMO_MULTI != 0)
      || BleApplicationContext.EndDevice_Connection_Status[1] != APP_BLE_CONNECTED_CLIENT || BleApplicationContext.EndDevice_Connection_Status[2] != APP_BLE_CONNECTED_CLIENT
      || BleApplicationContext.EndDevice_Connection_Status[3] != APP_BLE_CONNECTED_CLIENT|| BleApplicationContext.EndDevice_Connection_Status[4] != APP_BLE_CONNECTED_CLIENT
#endif
  )
  {
    /* USER CODE BEGIN APP_BLE_CONNECTED */
    //BSP_LED_On(LED_BLUE);
    /* USER CODE END APP_BLE_CONNECTED */
    result = aci_gap_start_general_discovery_proc(SCAN_P, SCAN_L, PUBLIC_ADDR, 1);
    if (result == BLE_STATUS_SUCCESS)
    {
    /* USER CODE BEGIN BLE_SCAN_SUCCESS */
    //device_list_index = 0;

    /* USER CODE END BLE_SCAN_SUCCESS */
      APP_DBG_MSG(" \r\n\r** START GENERAL DISCOVERY (SCAN) **  \r\n\r");
    }
    else
    {
    /* USER CODE BEGIN BLE_SCAN_FAILED */
      BSP_LED_On(LED_RED);
    /* USER CODE END BLE_SCAN_FAILED */
      APP_DBG_MSG("-- BLE_App_Start_Limited_Disc_Req, Failed \r\n\r");
    }
  }
  /* USER CODE BEGIN Scan_Request_2 */

  /* USER CODE END Scan_Request_2 */
  return;
}

/**
 * @brief  Advertising Enable
 * @param  None
 * @retval None
 */
static void Adv_Request( void )
{
  /* USER CODE BEGIN Connect_Request_1 */

  /* USER CODE END Connect_Request_1 */
  if (BleApplicationContext.SmartPhone_Connection_Status != APP_BLE_CONNECTED_SERVER)
  {
    tBleStatus result = 0x00;
    /*Start Advertising*/
    result = aci_gap_set_discoverable(ADV_IND,
                                      LEDBUTTON_CONN_ADV_INTERVAL_MIN,
                                      LEDBUTTON_CONN_ADV_INTERVAL_MAX,
                                      PUBLIC_ADDR,
                                      NO_WHITE_LIST_USE, /* use white list */
                                      sizeof(local_name),
                                      (uint8_t*)local_name,
                                      0,
                                      NULL,
                                      0,
                                      0);
    /* Send Advertising data */
    result = aci_gap_update_adv_data(sizeof(manuf_data), (uint8_t*) manuf_data);

    BleApplicationContext.SmartPhone_Connection_Status = APP_BLE_FAST_ADV;
    if (result == BLE_STATUS_SUCCESS)
    {
    /* USER CODE BEGIN BLE_CONNECT_SUCCESS */

    /* USER CODE END BLE_CONNECT_SUCCESS */
      APP_DBG_MSG("  \r\n\r");
      APP_DBG_MSG("** START ADVERTISING **  \r\n\r");

      scannedDevicesPackage.iterator = 0;
    }
    else
    {
    /* USER CODE BEGIN BLE_CONNECT_FAILED */
      BSP_LED_On(LED_RED);
    /* USER CODE END BLE_CONNECT_FAILED */
      APP_DBG_MSG("BLE_APP_Adv_Request(), Failed \r\n\r");
    }
  }
  /* USER CODE BEGIN Connect_Request_2 */

  /* USER CODE END Connect_Request_2 */
  return;
}

/**
 * @brief  Connection Establishement on SERVER 1
 * @param  None
 * @retval None
 */
static void ConnReq1( void )
{
  tBleStatus result;
  APP_DBG_MSG("\r\n\r** CREATE CONNECTION TO END DEVICE 1 **  \r\n\r");
  if (usedDeviceInformations[0].state != APP_BLE_CONNECTED_CLIENT && usedDeviceInformations[0].isNotEmpty == true)
  {
    /* USER CODE BEGIN APP_BLE_CONNECTED_SUCCESS_END_DEVICE_1 */

    /* USER CODE END APP_BLE_CONNECTED_SUCCESS_END_DEVICE_1 */
        result = aci_gap_create_connection(
        SCAN_P,
        SCAN_L,
		RANDOM_ADDR,
		usedDeviceInformations[0].macAddress,
        PUBLIC_ADDR,
        CONN_P(50),
        CONN_P(100),
        0,
        500,
        CONN_L(10),
        CONN_L(10));

    if (result == BLE_STATUS_SUCCESS)
    {
    /* USER CODE BEGIN BLE_STATUS_END_DEVICE_1_SUCCESS */
    	int index = getCorrespondingIndex(usedDeviceInformations[0].macAddress);

    /* USER CODE END BLE_STATUS_END_DEVICE_1_SUCCESS */
    	usedDeviceInformations[0].state  = APP_BLE_LP_CONNECTING;
    	scannedDevicesPackage.scannedDevicesList[index].pairingStatus = usedDeviceInformations[0].state;
    }
    else
    {
    /* USER CODE BEGIN BLE_STATUS_END_DEVICE_1_FAILED */
      BSP_LED_On(LED_RED);
    /* USER CODE END BLE_STATUS_END_DEVICE_1_FAILED */
      usedDeviceInformations[0].state  = APP_BLE_IDLE;
    }
  }

  return;
}

#if (CFG_P2P_DEMO_MULTI != 0)
    /* USER CODE BEGIN ConnReq1_Multi */
/**
 * @brief  Connection Establishement on SERVER 2
 * @param  None
 * @retval None
 */
static void ConnReq2( void )
{
  tBleStatus result;
  APP_DBG_MSG("\r\n\r** CREATE CONNECTION TO END DEVICE 2 **  \r\n\r");

  if (usedDeviceInformations[1].state != APP_BLE_CONNECTED_CLIENT && usedDeviceInformations[1].isNotEmpty == true)
  {


    result = aci_gap_create_connection(
        SCAN_P,
        SCAN_L,
		STATIC_RANDOM_ADDR,
		usedDeviceInformations[1].macAddress,
        PUBLIC_ADDR,
        CONN_P(50),
        CONN_P(100),
        0,
        500,
        CONN_L(10),
        CONN_L(10));

    if (result == BLE_STATUS_SUCCESS)
    {
    	int index = getCorrespondingIndex(usedDeviceInformations[1].macAddress);

    	usedDeviceInformations[1].state = APP_BLE_LP_CONNECTING;
        scannedDevicesPackage.scannedDevicesList[index].pairingStatus = usedDeviceInformations[1].state ;

    }
    else
    {
      BSP_LED_On(LED_RED);
      usedDeviceInformations[1].state = APP_BLE_IDLE;

    }
  }

  return;
}

/**
 * @brief  Connection Establishement on SERVER 3
 * @param  None
 * @retval None
 */
static void ConnReq3( void )
{
  tBleStatus result;
  APP_DBG_MSG("\r\n\r** CREATE CONNECTION TO END DEVICE 3 **  \r\n\r");
  if (usedDeviceInformations[2].state != APP_BLE_CONNECTED_CLIENT && usedDeviceInformations[2].isNotEmpty == true)
  {

    result = aci_gap_create_connection(
        SCAN_P,
        SCAN_L,
		RANDOM_ADDR,
		usedDeviceInformations[2].macAddress,
        PUBLIC_ADDR,
        CONN_P(50),
        CONN_P(100),
        0,
        500,
        CONN_L(10),
        CONN_L(10));

    if (result == BLE_STATUS_SUCCESS)
    {
    	int index = getCorrespondingIndex(usedDeviceInformations[2].macAddress);

    	usedDeviceInformations[2].state = APP_BLE_LP_CONNECTING;
        scannedDevicesPackage.scannedDevicesList[index].pairingStatus = usedDeviceInformations[2].state;

