lilag-dawg/OSS_MCU/BLE_p2pRouteur/STM32_WPAN/App/app_ble.c
static void BLE_StatusNot( HCI_TL_CmdStatus_t status )
{
  uint32_t task_id_list;
  switch (status)
  {
    case HCI_TL_CmdBusy:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_PauseTask(task_id_list);

      break;

    case HCI_TL_CmdAvailable:
      /**
       * All tasks that may send an aci/hci commands shall be listed here
       * This is to prevent a new command is sent while one is already pending
       */
      task_id_list = (1 << CFG_LAST_TASK_ID_WITH_HCICMD) - 1;
      UTIL_SEQ_ResumeTask(task_id_list);

      break;

    default:
      break;
  }
  return;
}

void SVCCTL_ResumeUserEventFlow( void )
{
  hci_resume_flow();
  return;
}

void defineMethodes(int size, UsedDeviceInformations_t *self){
	for(int i = 0; i< size; i++){
		self[i].getServiceIndex = getServiceIndex;
		self[i].verifyIfServiceExists = verifyIfServiceExists;
		self[i].appendService = appendService;
		self[i].appendServiceName = appendServiceName;
		defineServiceMethodes(sizeof(self[i].services)/sizeof(Service_t), self[i].services);
	}
}

void defineServiceMethodes(int size, Service_t *self){
	for(int i = 0; i< size; i++){
		self[i].isCharHandleEmpty = isCharHandleEmpty;
		self[i].isDescHandleEmpty = isDescHandleEmpty;
		self[i].getCharacteristicIndex = getCharacteristicIndex;
		self[i].verifyIfCharacteristicExists = verifyIfCharacteristicExists;
		self[i].appendCharacteristic = appendCharacteristic;
		self[i].appendCharacteristicName = appendCharacteristicName;
	}
}

bool isCharHandleEmpty(Service_t *self) {
	for(int i = 0; i < (sizeof(self->characteristics)/sizeof(Characteristic_t)); i++) {
		if(self->characteristics[i].charHandle != 0){
			return false;
		}
	}
	return true;
}

bool isDescHandleEmpty(Service_t *self) {
	for(int i = 0; i < (sizeof(self->characteristics)/sizeof(Characteristic_t)); i++) {
		if(self->characteristics[i].descHandle != 0){
			return false;
		}
	}
	return true;
}

int getCharacteristicIndex(uint16_t name, Service_t *self) {
	for(int i = 0; i < (sizeof(self->characteristics)/sizeof(Characteristic_t)); i++) {
		if(self->characteristics[i].name == name) {
			return i;
		}
	}

	return -1;
}

bool verifyIfCharacteristicExists(uint16_t name, Service_t *self){
	for(int i = 0; i < (sizeof(self->characteristics)/sizeof(Characteristic_t)); i++) {
		if(self->characteristics[i].name == name) {
			return true;
		}
	}
	return false;
}

int appendCharacteristic(Characteristic_t *characteristic, Service_t *self){
	for(int i = 0; i < (sizeof(self->characteristics)/sizeof(Characteristic_t)); i++) {
		if(self->characteristics[i].name == NULL) {
			memcpy(&self->characteristics[i], characteristic, sizeof(Characteristic_t));
			return i;
		}
	}
	return -1;
}

int appendCharacteristicName(uint16_t name, Service_t *self){
	for(int i = 0; i < (sizeof(self->characteristics)/sizeof(Characteristic_t)); i++) {
		if(self->characteristics[i].name == NULL) {
			self->characteristics[i].name = name;
			return i;
		}
	}
	return -1;
}

int getServiceIndex(uint16_t name, UsedDeviceInformations_t *self) {

	for(int i = 0; i < (sizeof(self->services)/sizeof(Service_t)); i++) {
		if(self->services[i].name == name) {
			return i;
		}
	}

	return -1;
}

bool verifyIfServiceExists(uint16_t name, UsedDeviceInformations_t *self) {
	for(int i = 0; i < (sizeof(self->services)/sizeof(Service_t)); i++) {
		if(self->services[i].name == name) {
			return true;
		}
	}
	return false;
}

int appendService(Service_t *service, UsedDeviceInformations_t *self) {
	for(int i = 0; i < (sizeof(self->services)/sizeof(Service_t)); i++) {
		if(self->services[i].name == NULL) {
			memcpy(&self->services[i], service, sizeof(Service_t));
			return i;
		}
	}
	return -1;
}

int appendServiceName(uint16_t name, UsedDeviceInformations_t *self) {
	for(int i = 0; i < (sizeof(self->services)/sizeof(Service_t)); i++) {
		if(self->services[i].name == NULL) {
			self->services[i].name = name;
			return i;
		}
	}
	return -1;
}

Characteristic_t* getCharacteristic(uint16_t charHandle, UsedDeviceInformations_t *parentDevice) {
	for(int i = 0; i < (sizeof(parentDevice->services)/sizeof(Service_t)); i++) {
		for(int j = 0; j < (sizeof(parentDevice->services[i].characteristics)/sizeof(Characteristic_t)); j++) {
			if(parentDevice->services[i].characteristics[j].charHandle == charHandle) {
				return &parentDevice->services[i].characteristics[j];
			}
		}
	}
	return NULL;
}

void clearList(UsedDeviceInformations_t *parentDevice) {

	parentDevice->currentReadingInfo.serviceName = 0;
	parentDevice->currentReadingInfo.serv_idx = 0;
	parentDevice->currentReadingInfo.charName = 0;
	parentDevice->currentReadingInfo.char_idx = 0;

	for(int i = 0; i < (sizeof(parentDevice->services)/sizeof(Service_t)); i++) {
		parentDevice->services[i].name = 0;
		parentDevice->services[i].servHandle = 0;
		parentDevice->services[i].servEndHandle = 0;
		for(int k = 0; k < (sizeof(parentDevice->services[i].characteristics)/sizeof(Characteristic_t)); k++){
			parentDevice->services[i].characteristics[k].name = 0;
			parentDevice->services[i].characteristics[k].charHandle = 0;
			parentDevice->services[i].characteristics[k].descHandle = 0;
			parentDevice->services[i].characteristics[k].isNotifying = false;
		}
	}
}
/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

/* USER CODE END FD_WRAP_FUNCTIONS */
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
